<?php
/**

本配置在各版本的Api接口模块通用，修改时请注意兼容

 */

//项目配置
return [
    //足球推荐相关 兼容1.0 其他版本不用到
    'gamble' => [
        'norm_point'         => 100, //普通推荐积分
        'impt_point'         => 300, //重点推荐积分
        'weekday_norm_times' => 3,   //周1-4
        'weekday_impt_times' => 2,   //周5-7
        'weekend_norm_times' => 6,
        'weekend_impt_times' => 4
    ],

    //蓝球推荐相关 兼容1.0 其他版本不用到
    'gamblebk' => [
        'norm_point'         => 100, //普通推荐积分
        'impt_point'         => 300, //重点推荐积分
        'weekday_norm_times' => 3,   //周1-4
        'weekday_impt_times' => 2,   //周5-7
        'weekend_norm_times' => 6,
        'weekend_impt_times' => 4
    ],

    //账户明细类型 （此处配置增加 需在各相关地方
    'accountType' => [
        '1' => '营销支出',
        '2' => '在线提款',
        '3' => '查看推荐',
        '4' => '销售分成',
        '5' => '系统赠送',
        '6' => '积分兑换',
        '7' => '充值收入',
        '8' => '自动充值',
        '9' => '系统扣除',
        '10'=> '提款失败退回',
        '11'=> '返还查看金币',
        '12'=> '扣除分成金币',
        '13'=> '邀请好友',
        '14'=> '重置数据',
        '15'=> '购买体验券',
        '16'=> '优惠券充值赠送',
        '17'=> '购买球王服务',
        '18'=> '球王服务退款',
        '19'=> '聊天室表情包赠送',
        '20'=> '稿费结算',
        '21'=> '世界杯好友助力活动',
        '22'=> '礼物收入',
        '23'=> '红包收入',
        '24'=> '充值回退',
        '25'=> '购买预测模型会员',
        '26'=> '续费预测模型会员',
    ],

    //支出类型
    'payAccountType' => ['2', '3', '9', '12', '14','15','17','19','25','26'],

    //账户明细状态 （此处配置增加 需在各相关地方
    'accountStatus' => [
        '0' => '申请中',
        '1' => '成功',
        '2' => '不通过',
        '3' => '待汇款',
        '4' => '驳回',
        '5' => '冻结',
        '6' => '待结算',
        '7' => '已退回',
    ],

    //积分明细类型 （此处配置增加 需在各相关地方
    'pointType' => [
        '1'  => '推荐收入',
        '2'  => '推荐支出',
        '5'  => '系统赠送',
        '6'  => '积分兑换',
        '11' => '登陆赠送',
        '12' => '推荐分析',
        '13' => '抽奖赠送',
        '14' => '完成任务',
        '15' => '完成成就',
        '16' => '每日签到',
        '17' => '推荐分享',
        '18' => '推荐结算纠正增加',
        '19' => '推荐结算纠正扣除',
        '20' => '音频分析',
    ],

    //IOS提款金额限制数目
    'ios_extract_money' => 50,

    //绑定充值成功后送5金币
    'bindPayCoin' => 5,

    //大礼包推荐和充值名字
    'giftPrice'    => '金币推荐一场',
    'giftGiveCoin' => '',
    'giftPrice2'   => 'Q币推荐一场',

    //文章替换的分类id
    //'classId' => [2, 3, 18, 28],

    //产品结算近几中几
    'introRateNum' => 5,
];
 ?>